#### BuiltInFailures.SweepFailures Members

---

|  |
| --- |
| BuiltInFailures SweepFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SweepFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotDrawSweep | Can't create sweep. |
| Public property Static member | ComplexPathWithComplexProfile | Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines. |
| Public property Static member | ProfileLoopEmpty | Profile sketch is empty! |
| Public property Static member | SweepFailed | Proper sweep geometry creation failed. |
| Public property Static member | SweepFailedError | Proper sweep geometry creation failed. |
| Public property Static member | WallSweepInconsistent | The model contains corrupt elements. Delete the corrupt elements to proceed or cancel the action without deleting the elements. |

# See Also

BuiltInFailures SweepFailures Class

Autodesk.Revit.DB Namespace